{"class_name": "Sequential", "keras_version": "2.2.4", "backend": "tensorflow", "config": {"layers": [{"class_name": "Conv2D", "config": {"data_format": "channels_last", "name": "conv2d_1", "activity_regularizer": null, "bias_constraint": null, "kernel_size": [20, 14], "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "padding": "valid", "strides": [1, 1], "use_bias": true, "activation": "relu", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "kernel_regularizer": null, "filters": 50, "dilation_rate": [1, 1], "trainable": true}}, {"class_name": "MaxPooling2D", "config": {"pool_size": [1, 2], "padding": "valid", "data_format": "channels_last", "name": "max_pooling2d_1", "strides": [1, 2], "trainable": true}}, {"class_name": "Flatten", "config": {"trainable": true, "data_format": "channels_last", "name": "flatten_1"}}, {"class_name": "Dropout", "config": {"trainable": true, "rate": 0.3, "noise_shape": null, "seed": null, "name": "dropout_1"}}, {"class_name": "Dense", "config": {"name": "dense_1", "activity_regularizer": null, "bias_constraint": null, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "kernel_constraint": null, "activation": "relu", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "kernel_regularizer": null, "trainable": true, "units": 650}}, {"class_name": "Dropout", "config": {"trainable": true, "rate": 0.3, "noise_shape": null, "seed": null, "name": "dropout_2"}}, {"class_name": "Dense", "config": {"name": "dense_2", "activity_regularizer": null, "bias_constraint": null, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "kernel_constraint": null, "activation": "softmax", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "kernel_regularizer": null, "trainable": true, "units": 2}}], "build_input_shape": [null, 20, 150, 1], "name": "sequential_1"}}